-- +goose Up
-- +goose StatementBegin
CREATE TABLE IF NOT EXISTS mcc_codes (
    mcc_code VARCHAR(4) NOT NULL,
    name TEXT NOT NULL,
    category_group TEXT NOT NULL,
    CONSTRAINT unique_mcc_code UNIQUE (mcc_code)
    );

CREATE INDEX IF NOT EXISTS idx_mcc_code_hash ON mcc_codes USING HASH (mcc_code);

INSERT INTO mcc_codes(mcc_code, name, category_group) VALUES ('5411', 'Супермаркеты и бакалея', 'Продукты'),
                                                             ('5499', 'Продуктовые магазины у дома', 'Продукты'),
                                                             ('5812', 'Рестораны и кафе', 'Кафе и рестораны'),
                                                             ('5814', 'Фастфуд', 'Кафе и рестораны'),
                                                             ('4121', 'Такси и лимузины', 'Транспорт'),
                                                             ('4111', 'Общественный транспорт и паромы', 'Транспорт'),
                                                             ('4112', 'Железнодорожные билеты', 'Транспорт'),
                                                             ('4511', 'Авиабилеты и авиакомпании', 'Транспорт'),
                                                             ('5541', 'Заправочные станции (АЗС)', 'Автомобиль'),
                                                             ('7538', 'Автосервисы и СТО', 'Автомобиль'),
                                                             ('5552', 'Зарядка электромобилей', 'Автомобиль'),
                                                             ('5262', 'Маркетплейсы', 'Покупки'),
                                                             ('5300', 'Оптовые склады и закупки', 'Покупки'),
                                                             ('5651', 'Одежда для всей семьи', 'Одежда и обувь'),
                                                             ('5661', 'Обувные магазины', 'Одежда и обувь'),
                                                             ('5941', 'Спортивные товары', 'Спорт'),
                                                             ('5732', 'Электроника и бытовая техника', 'Техника'),
                                                             ('5211', 'Строительные материалы', 'Ремонт'),
                                                             ('5712', 'Мебель и товары для дома', 'Ремонт'),
                                                             ('5912', 'Аптеки', 'Здоровье'),
                                                             ('8011', 'Медицинские клиники и врачи', 'Здоровье'),
                                                             ('7230', 'Салоны красоты', 'Красота'),
                                                             ('7997', 'Фитнес-клубы и спортсекции', 'Спорт'),
                                                             ('7832', 'Кинотеатры', 'Развлечения'),
                                                             ('5942', 'Книжные магазины', 'Хобби'),
                                                             ('7999', 'Отдых и развлечения', 'Развлечения'),
                                                             ('5815', 'Цифровые фильмы, музыка, книги', 'Подписки'),
                                                             ('4899', 'Кабельное и платное ТВ', 'Подписки'),
                                                             ('4814', 'Мобильная связь', 'Связь'),
                                                             ('4900', 'Коммунальные услуги (ЖКХ)', 'Жилье'),
                                                             ('9311', 'Налоговые платежи', 'Госуслуги')
    ON CONFLICT (mcc_code) DO NOTHING;
-- +goose StatementEnd

-- +goose Down
-- +goose StatementBegin
DROP TABLE IF EXISTS mcc_codes;
-- +goose StatementEnd